// 1. Дано четное число N (>0) и символы c1 и c2.
// Написать метод, который вернет строку длины N, которая состоит из чередующихся символов c1 и c2, начиная с c1.
// (6, 'a', 'b') -> "ababab"

package Seminars.HomeWork.Seminar_2;

public class Ex_1 {
    //        System.out.println(buildString(6, 'a', 'b')); // "ababab"

//        Path of = Path.of("file.txt");
//        System.out.println(Files.exists(of));
//
//        Files.createFile(of);
//        System.out.println(Files.exists(of));

// Path dir = Path.of("file.txt");
//        Files.createDirectories(dir);

//        Files.delete(dir);/

        // Files.writeString(dir, "tewtwtt");
}
